// (Для решения задания вам потребуется оператор остаток от деления %, например 10%3 === 1 , десять разделить на 3, остаток 1, второй пример 7 % 5, тут остаток от деления будет 2, ну и 3 пример это 14 % 10 === 4, остаток от деления на 10 будет равен 4)

// Необходимо от пользователя получить число.
// Необходимо вывести разряды числа, а именно: количество сотен, десятков и единиц.

// Пример:
// Пользователь ввел число 163. Программа должна вывести:
// "В числе 163 количество сотен: 1, десятков: 6, единиц: 3"

// Пример 2:
// Пользователь ввел число 74. Программа должна вывести:
// "В числе 74 количество сотен: 0, десятков: 7, единиц: 4"

// Пример 3:
// Пользователь ввел число 9537. Программа должна вывести:
// "В числе 9537 количество сотен: 5, десятков: 3, единиц: 7"



let day = Number(prompt('Введите положительное целое число'));
let units = day % 10;
unitsDay = day / 10;
let dozen = unitsDay % 10;
dozenDay = unitsDay / 10;
let hundred = dozenDay % 10;
alert(`В числе ${day} количество сотен: ${Math.floor(hundred)}, десятков: ${Math.floor(dozen)}, единиц: ${Math.floor(units)}`)